; domain
(define (domain zenotravel)
	(:requirements :typing :negative-preconditions)
	(:types
		Time - Object
		City - Object
		Aircraft - Thing
		Person - Thing
		Thing - Object
		FLevel - Object
	)
	(:predicates
		(at ?arg0 - Thing ?arg1 - City)
		(in ?arg0 - Person ?arg1 - Aircraft)
		(next ?arg0 - FLevel ?arg1 - FLevel)
		(max ?arg0 - FLevel)
        (min ?arg0 - FLevel)
        (not-min ?arg0 - FLevel)
		(fuel-level ?arg0 - Aircraft ?arg1 - FLevel)
	)
	(:action board
		:parameters (?p - Person ?a - Aircraft ?c - City)
		:precondition
			(and
				(at ?p ?c)
                (at ?a ?c)
			)
		:effect
			(and
				(not (at ?p ?c))
				(in ?p ?a)
			)
	)

	(:action debark
		:parameters (?p - Person ?a - Aircraft ?c - City)
		:precondition
			(and
				(in ?p ?a)
                (at ?a ?c)
			)
		:effect
			(and
				(not (in ?p ?a))
				(at ?p ?c)
			)
	)

	(:action refuel
		:parameters (?a - Aircraft ?l - FLevel ?l1 - FLevel)
		:precondition
			(and
				(fuel-level ?a ?l)
			)
		:effect
			(and
				(not (fuel-level ?a ?l))
				(fuel-level ?a ?l1)
			)
	)

	(:action fly
		:parameters (?a - Aircraft ?c1 - City ?c2 - City ?l1 - FLevel ?l2 - FLevel)
		:precondition
			(and
				(at ?a ?c1)
				(fuel-level ?a ?l1)
                (next ?l2 ?l1)
			)
		:effect
			(and
				(not (at ?a ?c1))
				(at ?a ?c2)
				(not (fuel-level ?a ?l1))
				(fuel-level ?a ?l2)
			)
	)
)

; problem
(define (problem p7)
(:domain zenotravel)
(:objects
 f0 f1 f2 - FLevel
 a1 a2 - Aircraft
 c1 c2 c3 c4 c5 c6 c7 c8 c9 - City
 p1 p2 p3 p4 p5 p6 p7 p8 p9 p10 p11 p12 p13 - Person
)
(:init
(min f0) (max f2)
(next f0 f1)
(not-min f1)
(next f1 f2)
(not-min f2)
(fuel-level a1 f2) (at a1 c2)
(fuel-level a2 f2) (at a2 c4)
(at p1 c4)
(at p2 c9)
(at p3 c9)
(at p4 c2)
(at p5 c8)
(at p6 c7)
(at p7 c6)
(at p8 c6)
(at p9 c4)
(at p10 c3)
(at p11 c7)
(at p12 c3)
(at p13 c8)
)
(:goal (and
(at a1 c2)
(at a2 c4)
(at p1 c1)
(at p2 c9)
(at p3 c1)
(at p4 c1)
(at p5 c7)
(at p6 c6)
(at p7 c2)
(at p8 c9)
(at p9 c5)
(at p10 c2)
(at p11 c7)
(at p12 c3)
(at p13 c2)
))
)

; plan
1. (board p1 a2 c4)
   deleted: (at p1 c4)
   added: (in p1 a2)
   goals met: 5 of 15
2. (fly a2 c4 c1 f2 f1)
   deleted: (at a2 c4) (fuel-level a2 f2)
   added: (at a2 c1) (fuel-level a2 f1)
   goals met: 4 of 15
3. (debark p1 a2 c1)
   deleted: (in p1 a2)
   added: (at p1 c1)
   goals met: 5 of 15
4. (fly a1 c2 c9 f2 f1)
   deleted: (at a1 c2) (fuel-level a1 f2)
   added: (at a1 c9) (fuel-level a1 f1)
   goals met: 4 of 15
5. (board p3 a1 c9)
   deleted: (at p3 c9)
   added: (in p3 a1)
   goals met: 4 of 15
6. (fly a1 c9 c1 f1 f0)
   deleted: (at a1 c9) (fuel-level a1 f1)
   added: (at a1 c1) (fuel-level a1 f0)
   goals met: 4 of 15
7. (debark p3 a1 c1)
   deleted: (in p3 a1)
   added: (at p3 c1)
   goals met: 5 of 15
8. (fly a2 c1 c2 f1 f0)
   deleted: (at a2 c1) (fuel-level a2 f1)
   added: (at a2 c2) (fuel-level a2 f0)
   goals met: 5 of 15
9. (board p4 a2 c2)
   deleted: (at p4 c2)
   added: (in p4 a2)
   goals met: 5 of 15
10. (refuel a2 f0 f2)
   deleted: (fuel-level a2 f0)
   added: (fuel-level a2 f2)
   goals met: 5 of 15
11. (fly a2 c2 c1 f2 f1)
   deleted: (at a2 c2) (fuel-level a2 f2)
   added: (at a2 c1) (fuel-level a2 f1)
   goals met: 5 of 15
12. (debark p4 a2 c1)
   deleted: (in p4 a2)
   added: (at p4 c1)
   goals met: 6 of 15
13. (fly a2 c1 c8 f1 f0)
   deleted: (at a2 c1) (fuel-level a2 f1)
   added: (at a2 c8) (fuel-level a2 f0)
   goals met: 6 of 15
14. (board p5 a2 c8)
   deleted: (at p5 c8)
   added: (in p5 a2)
   goals met: 6 of 15
15. (refuel a2 f0 f2)
   deleted: (fuel-level a2 f0)
   added: (fuel-level a2 f2)
   goals met: 6 of 15
16. (fly a2 c8 c7 f2 f1)
   deleted: (at a2 c8) (fuel-level a2 f2)
   added: (at a2 c7) (fuel-level a2 f1)
   goals met: 6 of 15
17. (debark p5 a2 c7)
   deleted: (in p5 a2)
   added: (at p5 c7)
   goals met: 7 of 15
18. (board p6 a2 c7)
   deleted: (at p6 c7)
   added: (in p6 a2)
   goals met: 7 of 15
19. (fly a2 c7 c6 f1 f0)
   deleted: (at a2 c7) (fuel-level a2 f1)
   added: (at a2 c6) (fuel-level a2 f0)
   goals met: 7 of 15
20. (debark p6 a2 c6)
   deleted: (in p6 a2)
   added: (at p6 c6)
   goals met: 8 of 15
21. (board p7 a2 c6)
   deleted: (at p7 c6)
   added: (in p7 a2)
   goals met: 8 of 15
22. (refuel a2 f0 f2)
   deleted: (fuel-level a2 f0)
   added: (fuel-level a2 f2)
   goals met: 8 of 15
23. (fly a2 c6 c2 f2 f1)
   deleted: (at a2 c6) (fuel-level a2 f2)
   added: (at a2 c2) (fuel-level a2 f1)
   goals met: 8 of 15
24. (debark p7 a2 c2)
   deleted: (in p7 a2)
   added: (at p7 c2)
   goals met: 9 of 15
25. (fly a2 c2 c6 f1 f0)
   deleted: (at a2 c2) (fuel-level a2 f1)
   added: (at a2 c6) (fuel-level a2 f0)
   goals met: 9 of 15
26. (board p8 a2 c6)
   deleted: (at p8 c6)
   added: (in p8 a2)
   goals met: 9 of 15
27. (refuel a2 f0 f2)
   deleted: (fuel-level a2 f0)
   added: (fuel-level a2 f2)
   goals met: 9 of 15
28. (fly a2 c6 c9 f2 f1)
   deleted: (at a2 c6) (fuel-level a2 f2)
   added: (at a2 c9) (fuel-level a2 f1)
   goals met: 9 of 15
29. (debark p8 a2 c9)
   deleted: (in p8 a2)
   added: (at p8 c9)
   goals met: 10 of 15
30. (fly a2 c9 c4 f1 f0)
   deleted: (at a2 c9) (fuel-level a2 f1)
   added: (at a2 c4) (fuel-level a2 f0)
   goals met: 11 of 15
31. (board p9 a2 c4)
   deleted: (at p9 c4)
   added: (in p9 a2)
   goals met: 11 of 15
32. (refuel a2 f0 f2)
   deleted: (fuel-level a2 f0)
   added: (fuel-level a2 f2)
   goals met: 11 of 15
33. (fly a2 c4 c5 f2 f1)
   deleted: (at a2 c4) (fuel-level a2 f2)
   added: (at a2 c5) (fuel-level a2 f1)
   goals met: 10 of 15
34. (debark p9 a2 c5)
   deleted: (in p9 a2)
   added: (at p9 c5)
   goals met: 11 of 15
35. (fly a2 c5 c3 f1 f0)
   deleted: (at a2 c5) (fuel-level a2 f1)
   added: (at a2 c3) (fuel-level a2 f0)
   goals met: 11 of 15
36. (board p10 a2 c3)
   deleted: (at p10 c3)
   added: (in p10 a2)
   goals met: 11 of 15
37. (refuel a2 f0 f2)
   deleted: (fuel-level a2 f0)
   added: (fuel-level a2 f2)
   goals met: 11 of 15
38. (fly a2 c3 c2 f2 f1)
   deleted: (at a2 c3) (fuel-level a2 f2)
   added: (at a2 c2) (fuel-level a2 f1)
   goals met: 11 of 15
39. (debark p10 a2 c2)
   deleted: (in p10 a2)
   added: (at p10 c2)
   goals met: 12 of 15
40. (fly a2 c2 c8 f1 f0)
   deleted: (at a2 c2) (fuel-level a2 f1)
   added: (at a2 c8) (fuel-level a2 f0)
   goals met: 12 of 15
41. (board p13 a2 c8)
   deleted: (at p13 c8)
   added: (in p13 a2)
   goals met: 12 of 15
42. (refuel a2 f0 f2)
   deleted: (fuel-level a2 f0)
   added: (fuel-level a2 f2)
   goals met: 12 of 15
43. (fly a2 c8 c2 f2 f1)
   deleted: (at a2 c8) (fuel-level a2 f2)
   added: (at a2 c2) (fuel-level a2 f1)
   goals met: 12 of 15
44. (debark p13 a2 c2)
   deleted: (in p13 a2)
   added: (at p13 c2)
   goals met: 13 of 15
45. (refuel a1 f0 f2)
   deleted: (fuel-level a1 f0)
   added: (fuel-level a1 f2)
   goals met: 13 of 15
46. (fly a1 c1 c2 f2 f1)
   deleted: (at a1 c1) (fuel-level a1 f2)
   added: (at a1 c2) (fuel-level a1 f1)
   goals met: 14 of 15
47. (fly a2 c2 c4 f1 f0)
   deleted: (at a2 c2) (fuel-level a2 f1)
   added: (at a2 c4) (fuel-level a2 f0)
   goals met: 15 of 15
